ProgessBase/Catalogs/ис_ПоказателиОтложенныхНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ис_ПоказателиОтложенныхНалогов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РасчетПоФормуле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРазницы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ис_ВидыРазницыОтложенногоНалога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчетаБалансовойСтоимости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчетаНалоговойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регистр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обороты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальноеСальдо</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечныйПоказатель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Условия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипыЗначений</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВИерархии</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИспользуемыеВыражения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ProgessBase/Catalogs/ис_ПоказателиОтложенныхНалогов/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	//начало изменений Ожиганов 14.07.2015 создание базы МСФО
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;  
	//конец изменений	
	
	лМенеджер = Справочники[Метаданные().Имя];
	
	Если РасчетПоФормуле Тогда 
		
		Если Не ЗначениеЗаполнено(ВидРазницы) Тогда 
			Отказ = Истина;
			Сообщить("Не заполнено поле <Вид разницы>", СтатусСообщения.Внимание);
		КонецЕсли;
		
		ФормулаРасчетаБалансовойСтоимости = СокрЛП(ФормулаРасчетаБалансовойСтоимости);
		Если ЗначениеЗаполнено(ФормулаРасчетаБалансовойСтоимости) Тогда 
			лОшибки = лМенеджер.ПроверитьКорректностьФормулы(ФормулаРасчетаБалансовойСтоимости);
			Если лОшибки.Количество() > 0 Тогда 
				Отказ = Истина;
				Для Каждого лОшибка Из лОшибки Цикл 
					Сообщить(лОшибка, СтатусСообщения.Внимание);
				КонецЦикла;
			КонецЕсли;
		Иначе
			Отказ = Истина;
			Сообщить("Не заполнено поле <Формула расчет балансовой стоимости>", СтатусСообщения.Внимание);
		КонецЕсли;
		
		ФормулаРасчетаНалоговойБазы = СокрЛП(ФормулаРасчетаНалоговойБазы);
		Если ЗначениеЗаполнено(ФормулаРасчетаНалоговойБазы) Тогда 
			лОшибки = лМенеджер.ПроверитьКорректностьФормулы(ФормулаРасчетаНалоговойБазы);
			Если лОшибки.Количество() > 0 Тогда 
				Отказ = Истина;
				Для Каждого лОшибка Из лОшибки Цикл 
					Сообщить(лОшибка, СтатусСообщения.Внимание);
				КонецЦикла;
			КонецЕсли;
		Иначе
			Отказ = Истина;
			Сообщить("Не заполнено поле <Формула расчет налоговой базы>", СтатусСообщения.Внимание);
		КонецЕсли;
		
	Иначе
		
		Если Не ЗначениеЗаполнено(Регистр) Тогда 
			Отказ = Истина;
			Сообщить("Не заполнено поле <Регистр>", СтатусСообщения.Внимание);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Ресурс) Тогда 
			Отказ = Истина;
			Сообщить("Не заполнено поле <Ресурс>", СтатусСообщения.Внимание);
		КонецЕсли;
		Для Каждого лСтрокаУсловия Из Условия Цикл 
			Если Не ЗначениеЗаполнено(лСтрокаУсловия.Параметр) Тогда 
				Отказ = Истина;
				Сообщить("В строке №"+лСтрокаУсловия.НомерСтроки+" не заполнено поле <Параметр>", СтатусСообщения.Внимание);
			КонецЕсли;
		КонецЦикла;
		
		Если Найти(Регистр, "РегистрБухгалтерии") > 0 Тогда 
			лСтрокаСчета = Условия.Найти("Счет", "ТипПараметра");
			Если лСтрокаСчета = Неопределено
			 И Не лСтрокаСчета.Использование Тогда 
			 	Отказ = Ложь;
				Сообщить("Не задан счет для регистра бухгалтерии");
			КонецЕсли;
		КонецЕсли;
		
		Если Не Отказ Тогда 
			лЗапрос = лМенеджер.СформироватьЗапрос(ЭтотОбъект);
			ТекстЗапроса = лЗапрос.Текст;
			ПараметрыЗапроса = Новый ХранилищеЗначения(лЗапрос.Параметры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
